In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('tips.csv')
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [3]:
#apply function

def last_four(n):
    return int(str(n)[-4:])

In [4]:
last_four(821665937687912)

7912

In [5]:
df['CC Number'][2]

6011812112971322

In [6]:
last_four(df['CC Number'][2])

1322

In [7]:
df['last_four'] = df['CC Number'].apply(last_four)
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,last_four
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,3410
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,9230
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,1322
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,5994
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,7221

In [8]:
df['total_bill'].mean()

19.78594262295082

In [9]:
def rating(price):
    if price <10:
        return '*'
    elif price >= 10 and price < df['total_bill'].mean():
        return '**'
    else:
        return '***'

In [10]:
df['rating'] = df['total_bill'].apply(rating)
df[['total_bill','rating']]

     total_bill rating
0         16.99     **
1         10.34     **
2         21.01    ***
3         23.68    ***
4         24.59    ***
..          ...    ...
239       29.03    ***
240       27.18    ***
241       22.67    ***
242       17.82     **
243       18.78     **

[244 rows x 2 columns]

In [11]:
df['tip'].describe()

count    244.000000
mean       2.998279
std        1.383638
min        1.000000
25%        2.000000
50%        2.900000
75%        3.562500
max       10.000000
Name: tip, dtype: float64

In [12]:
#column: Customer type: tip <= 2: 'Humble', 
#tip > 2 : 'Generous', tip > 2.9 : 'Valuable', tip > 3.56 : 'Most valuable'

In [14]:
def tip_type(t):
    if  t <= 2:
        return 'Humble'
    elif t <= 2.9:
        return 'Generous'
    elif t <= 3.56:
        return 'Valuable'
    else:
        return 'Most Valuable'

In [15]:
df['tip'].apply(tip_type)

0             Humble
1             Humble
2           Valuable
3           Valuable
4      Most Valuable
           ...
239    Most Valuable
240           Humble
241           Humble
242           Humble
243         Valuable
Name: tip, Length: 244, dtype: object

In [17]:
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID',
       'last_four', 'rating'],
      dtype='object')

In [18]:
#correlation
df[['total_bill', 'tip','price_per_person']].corr()

                  total_bill       tip  price_per_person
total_bill          1.000000  0.675734          0.647554
tip                 0.675734  1.000000          0.347405
price_per_person    0.647554  0.347405          1.000000

In [20]:
#max
df['total_bill'].max()

50.81

In [22]:
#min
df['total_bill'].min()

3.07

In [23]:
#index of max
df['total_bill'].idxmax()

170

In [24]:
#index of min
df['total_bill'].idxmin()

67

In [26]:
df.iloc[170]

total_bill                     50.81
tip                             10.0
sex                             Male
smoker                           Yes
day                              Sat
time                          Dinner
size                               3
price_per_person               16.94
Payer Name             Gregory Clark
CC Number           5473850968388236
Payment ID                   Sat1954
last_four                       8236
rating                           ***
Name: 170, dtype: object

In [27]:
#value counts

df['smoker'].value_counts()

smoker
No     151
Yes     93
Name: count, dtype: int64

In [28]:
df['size'].value_counts()

size
2    156
3     38
4     37
5      5
1      4
6      4
Name: count, dtype: int64

In [31]:
#replace
df['rating'].replace(to_replace='**',value='AVG')

0      AVG
1      AVG
2      ***
3      ***
4      ***
      ...
239    ***
240    ***
241    ***
242    AVG
243    AVG
Name: rating, Length: 244, dtype: object

In [32]:
#unique
df['size'].unique()

array([2, 3, 4, 1, 6, 5])

In [33]:
#nunique
df['size'].nunique()

6

In [34]:
#map
m = {'Female': 'F', 'Male':'M'}
df['sex'].map(m)

0      F
1      M
2      M
3      M
4      F
      ..
239    M
240    F
241    M
242    M
243    F
Name: sex, Length: 244, dtype: object

In [35]:
#duplicates

df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Length: 244, dtype: bool

In [40]:
sample_df = pd.DataFrame([[1,1],[2,3],[2,3]],['a','b','c'])
sample_df

   0  1
a  1  1
b  2  3
c  2  3

In [41]:
sample_df.duplicated()

a    False
b    False
c     True
dtype: bool

In [42]:
sample_df.drop_duplicates()

   0  1
a  1  1
b  2  3

In [47]:
#between
df[df['total_bill'].between(20,30, inclusive='left')]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,last_four,rating
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,1322,***
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,5994,***
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,7221,***
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679,7882,***
7,26.88,3.12,Male,No,Sun,Dinner,4,6.72,Robert Buck,3514785077705092,Sun8157,5092,***
...,...,...,...,...,...,...,...,...,...,...,...,...,...
229,22.12,2.88,Female,Yes,Sat,Dinner,2,11.06,Jennifer Russell,4793003293608,Sat3943,3608,***
230,24.01,2.00,Male,Yes,Sat,Dinner,4,6.00,Michael Osborne,4258682154026,Sat7872,4026,***
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,2842,***
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766,5404,***
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880,7196,***

In [48]:
df.nlargest(10,'tip')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,last_four,rating
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,8236,***
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,5212,***
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,9808,***
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139,595,***
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025,8508,***
183,23.17,6.50,Male,Yes,Sun,Dinner,4,5.79,Dr. Michael James,4718501859162,Sun6059,9162,***
214,28.17,6.50,Female,Yes,Sat,Dinner,3,9.39,Marissa Jackson,4922302538691962,Sat3374,1962,***
47,32.40,6.00,Male,No,Sun,Dinner,4,8.10,James Barnes,3552002592874186,Sun9677,4186,***
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,2842,***
88,24.71,5.85,Male,No,Thur,Lunch,2,12.36,Roger Taylor,4410248629955,Thur9003,9955,***

In [49]:
df.nsmallest(10,'tip')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,last_four,rating
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455,5267,*
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780,6392,*
111,7.25,1.00,Female,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801,6887,*
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032,3965,**
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,3410,**
215,12.90,1.10,Female,Yes,Sat,Dinner,2,6.45,Jessica Owen,4726904879471,Sat6983,9471,**
237,32.83,1.17,Male,Yes,Sat,Dinner,2,16.42,Thomas Brown,4284722681265508,Sat2929,5508,***
75,10.51,1.25,Male,No,Sat,Dinner,2,5.26,Kenneth Hayes,213142079731108,Sat5056,1108,**
135,8.51,1.25,Female,No,Thur,Lunch,2,4.26,Rebecca Harris,4320272020376174,Thur6600,6174,*
235,10.07,1.25,Male,No,Sat,Dinner,2,5.04,Sean Gonzalez,3534021246117605,Sat4615,7605,**